# IsCustom Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandlerType..::..IsCustom Method
StructuralConnectionHandlerType Class See Also
---
Checks if StructuralConnectionHandlerType is custom.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsCustom()
```

Visual Basic
---
```text
Public Function IsCustom As Boolean
```

Visual C++
---
```text
public:
bool IsCustom()
```

# ### Return Value
True if StructuralConnectionHandlerType is custom.
# See Also
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace